; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v3 - type_1 ?v5 - type_3)
 	      (pred_1 ?v4 - object ?v5 - type_3)
	      (pred_2 ?v3 - type_1 ?v2 - type_2)
	      (pred_3 ?v3 - type_1 ?v4 - object ?v2 - type_2))

   (:action op_2
       :parameters  (?v3 - type_1 ?v7 ?v8 - type_3)
       :precondition (and  (pred_4 ?v3 ?v7))
       :effect (and  (pred_4 ?v3 ?v8)
		     (not (pred_4 ?v3 ?v7))))

   (:action op_1
       :parameters (?v3 - type_1 ?v1 - object ?v6 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v6) (pred_4 ?v3 ?v6) (pred_2 ?v3 ?v2))
       :effect (and (pred_3 ?v3 ?v1 ?v2)
		    (not (pred_1 ?v1 ?v6)) 
		    (not (pred_2 ?v3 ?v2))))

   (:action op_3
       :parameters (?v3 - type_1 ?v1 - object ?v6 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v1 ?v2) (pred_4 ?v3 ?v6))
       :effect (and (pred_1 ?v1 ?v6)
		    (pred_2 ?v3 ?v2)
		    (not (pred_3 ?v3 ?v1 ?v2)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_08 - type_1
obj_06 obj_01 - type_2
obj_04 obj_09 obj_03 - type_3
obj_02 obj_05 obj_07 - object)
(:init
(pred_4 obj_08 obj_04)
(pred_2 obj_08 obj_06)
(pred_2 obj_08 obj_01)
(pred_1 obj_02 obj_04)
(pred_1 obj_05 obj_09)
(pred_1 obj_07 obj_09)
)
(:goal
(and
(pred_1 obj_02 obj_09)
(pred_1 obj_05 obj_03)
(pred_1 obj_07 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_08 ?b obj_06))))
)
)

; plan
1. (op_1 obj_08 obj_02 obj_04 obj_01)
   deleted: (pred_1 obj_02 obj_04) (pred_2 obj_08 obj_01)
   added: (pred_3 obj_08 obj_02 obj_01)
   goals met: 1 of 3
2. (op_2 obj_08 obj_04 obj_09)
   deleted: (pred_4 obj_08 obj_04)
   added: (pred_4 obj_08 obj_09)
   goals met: 1 of 3
3. (op_3 obj_08 obj_02 obj_09 obj_01)
   deleted: (pred_3 obj_08 obj_02 obj_01)
   added: (pred_1 obj_02 obj_09) (pred_2 obj_08 obj_01)
   goals met: 2 of 3
4. (op_1 obj_08 obj_05 obj_09 obj_01)
   deleted: (pred_1 obj_05 obj_09) (pred_2 obj_08 obj_01)
   added: (pred_3 obj_08 obj_05 obj_01)
   goals met: 2 of 3
5. (op_2 obj_08 obj_09 obj_03)
   deleted: (pred_4 obj_08 obj_09)
   added: (pred_4 obj_08 obj_03)
   goals met: 2 of 3
6. (op_3 obj_08 obj_05 obj_03 obj_01)
   deleted: (pred_3 obj_08 obj_05 obj_01)
   added: (pred_1 obj_05 obj_03) (pred_2 obj_08 obj_01)
   goals met: 3 of 3
